In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv('E:/All Project/salary_prediction/data/raw/web_data.csv')

In [3]:
df.head()

,company_names,allas,company_reviews
0,TCS,1.1L Reviews9.7L Salaries11.8k Interviews1.8k ...,3.3
1,Accenture,71.2k Reviews6.5L Salaries9.1k Interviews30.9k...,3.7
2,Wipro,63.5k Reviews4.8L Salaries6.6k Interviews7.8k ...,3.6
3,Cognizant,59.8k Reviews6L Salaries6.3k Interviews674 Job...,3.6
4,Capgemini,51.3k Reviews4.7L Salaries5.4k Interviews1.8k ...,3.7

In [4]:
df[df.duplicated()]

Empty DataFrame
Columns: [company_names, allas, company_reviews]
Index: []

In [5]:
df.drop_duplicates(inplace=True)

In [6]:
def drop_duplicates(data):
    df = data.drop_duplicates(inplace=True)
    return df

In [7]:
df.head()

,company_names,allas,company_reviews
0,TCS,1.1L Reviews9.7L Salaries11.8k Interviews1.8k ...,3.3
1,Accenture,71.2k Reviews6.5L Salaries9.1k Interviews30.9k...,3.7
2,Wipro,63.5k Reviews4.8L Salaries6.6k Interviews7.8k ...,3.6
3,Cognizant,59.8k Reviews6L Salaries6.3k Interviews674 Job...,3.6
4,Capgemini,51.3k Reviews4.7L Salaries5.4k Interviews1.8k ...,3.7

In [8]:
df['allas'][0]

'1.1L Reviews9.7L Salaries11.8k Interviews1.8k Jobs10.6k Benefits93 Photos'

In [15]:
df['allas'].str.split(' ')[0]

['1.1L',
 'Reviews9.7L',
 'Salaries11.8k',
 'Interviews2k',
 'Jobs10.6k',
 'Benefits93',
 'Photos']

In [9]:
Reviews = df['allas'].str.split('Reviews').str[0]
Salaries =df['allas'].str.split(' ').str[1].str.split('Reviews').str[1]
Interviews = df['allas'].str.split(' ').str[2].str.split('Salaries').str[1]
jobs = df['allas'].str.split(' ').str[3].str.split('Interviews').str[1]
Benefits = df['allas'].str.split(' ').str[4].str.split('Jobs').str[1]
photos = df['allas'].str.split(' ').str[5].str.split('Benefits').str[1]

In [10]:
def data_corect(df):
    df['Reviews'] = df['allas'].str.split('Reviews').str[0]
    df['Salaries'] = df['allas'].str.split(' ').str[1].str.split('Reviews').str[1]
    df['Interviews'] = df['allas'].str.split(' ').str[2].str.split('Salaries').str[1]
    df['jobs'] = df['allas'].str.split(' ').str[3].str.split('Interviews').str[1]
    df['Benefits'] = df['allas'].str.split(' ').str[4].str.split('Jobs').str[1]
    df['photos'] = df['allas'].str.split(' ').str[5].str.split('Benefits').str[1]
    df.drop(columns='allas',inplace=True)

    return df

In [11]:
data_corect(df)

,company_names,company_reviews,Reviews,Salaries,Interviews,jobs,Benefits,photos
0,TCS,3.3,1.1L,9.7L,11.8k,1.8k,10.6k,93
1,Accenture,3.7,71.2k,6.5L,9.1k,30.9k,6.7k,49
2,Wipro,3.6,63.5k,4.8L,6.6k,7.8k,4.6k,107
3,Cognizant,3.6,59.8k,6L,6.3k,674,5.5k,86
4,Capgemini,3.7,51.3k,4.7L,5.4k,1.8k,3.7k,42
...,...,...,...,...,...,...,...,...
515,Asirvad Microfinance,3.8,1.1k,2.2k,43,14,60,15
516,Hikal,3.9,1.1k,4.6k,75,52,86,4
517,Kohler,3.7,1.1k,4.8k,75,40,75,13
518,Unicharm,4.0,1.1k,2.8k,64,--,104,--
519,V2 Retail,3.4,1.1k,2.5k,81,15,83,13